podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USBPHY1_MK28F15.svd.xml
<!--
Devices using this peripheral: 
      MK28F15
-->
      <peripheral>
         <?sourceFile "USBPHY1_MK28F15" ?>
         <name>USBPHY1</name>
         <description>USBPHY Register Reference Index</description>
         <groupName>USBPHY</groupName>
         <headerStructName>USBPHY</headerStructName>
         <baseAddress>0x400A2000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x44</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x50</offset>
            <size>0x14</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x70</offset>
            <size>0x14</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xA0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC0</offset>
            <size>0x14</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xF0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PWD</name>
               <description>USB PHY Power-Down Register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x1E1C00</resetValue>
               <fields>
                  <field>
                     <name>TXPWDFS</name>
                     <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power-down the USB full-speed drivers. This turns off the current starvation sources and puts the drivers into high-impedance output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXPWDIBIAS</name>
                     <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power-down the USB PHY current bias block for the transmitter. This bit should be set only when the USB is in suspend mode. This effectively powers down the entire USB transmit path</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXPWDV2I</name>
                     <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power-down the USB PHY transmit V-to-I converter and the current mirror</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXPWDENV</name>
                     <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power-down the USB high-speed receiver envelope detector (squelch signal)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXPWD1PT1</name>
                     <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power-down the USB full-speed differential receiver</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXPWDDIFF</name>
                     <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power-down the USB high-speed differential receiver</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXPWDRX</name>
                     <description>This bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power-down the entire USB PHY receiver block except for the full-speed differential receiver</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register derivedFrom="PWD"> <name>PWD_SET</name> <addressOffset>0x4</addressOffset> </register>
            <register derivedFrom="PWD"> <name>PWD_CLR</name> <addressOffset>0x8</addressOffset> </register>
            <register derivedFrom="PWD"> <name>PWD_TOG</name> <addressOffset>0xC</addressOffset> </register>
            <register>
               <name>TX</name>
               <description>USB PHY Transmitter Control Register</description>
               <addressOffset>0x10</addressOffset>
               <resetValue>0x10060607</resetValue>
               <fields>
                  <field>
                     <name>D_CAL</name>
                     <description>Decode to trim the nominal 17</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>Maximum current, approximately 19% above nominal</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>Nominal</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>Minimum current, approximately 19% below nominal</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXCAL45DM</name>
                     <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DM output pin</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXCAL45DP</name>
                     <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DP output pin</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>USBPHY_TX_EDGECTRL</name>
                     <description>Controls the edge-rate of the current sensing transistors used in HS transmit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="TX"> <name>TX_SET</name> <addressOffset>0x14</addressOffset> </register>
            <register derivedFrom="TX"> <name>TX_CLR</name> <addressOffset>0x18</addressOffset> </register>
            <register derivedFrom="TX"> <name>TX_TOG</name> <addressOffset>0x1C</addressOffset> </register>
            <register>
               <name>RX</name>
               <description>USB PHY Receiver Control Register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>ENVADJ</name>
                     <description>The ENVADJ field adjusts the trip point for the envelope detector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Trip-Level Voltage is 0.1000 V</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Trip-Level Voltage is 0.1125 V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Trip-Level Voltage is 0.1250 V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Trip-Level Voltage is 0.0875 V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DISCONADJ</name>
                     <description>The DISCONADJ field adjusts the trip point for the disconnect detector</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Trip-Level Voltage is 0.56875 V</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Trip-Level Voltage is 0.55000 V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Trip-Level Voltage is 0.58125 V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Trip-Level Voltage is 0.60000 V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXDBYPASS</name>
                     <description>This test mode is intended for lab use only, replace FS differential receiver with DP single ended receiver</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Use the output of the USB_DP single-ended receiver in place of the full-speed differential receiver</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register derivedFrom="RX"> <name>RX_SET</name> <addressOffset>0x24</addressOffset> </register>
            <register derivedFrom="RX"> <name>RX_CLR</name> <addressOffset>0x28</addressOffset> </register>
            <register derivedFrom="RX"> <name>RX_TOG</name> <addressOffset>0x2C</addressOffset> </register>
            <register>
               <name>CTRL</name>
               <description>USB PHY General Control Register</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0xC0000000</resetValue>
               <fields>
                  <field>
                     <name>ENHOSTDISCONDETECT</name>
                     <description>For host mode, enables high-speed disconnect detector</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HOSTDISCONDETECT_IRQ</name>
                     <description>Indicates that the device has disconnected in High-Speed mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDEVPLUGINDET</name>
                     <description>Enables non-standard resistive plugged-in detection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disables 200kohm pullup resistors on USB_DP and USB_DM pins (Default)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enables 200kohm pullup resistors on USB_DP and USB_DM pins</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DEVPLUGIN_IRQ</name>
                     <description>Indicates that the device is connected</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENUTMILEVEL2</name>
                     <description>Enables UTMI+ Level 2 operation for the USB HS PHY</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENUTMILEVEL3</name>
                     <description>Enables UTMI+ Level 3 operation for the USB HS PHY</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTORESUME_EN</name>
                     <description>Enable the auto resume feature, when set, HW will use 32KHz clock to send Resume to respond to the device remote wakeup(for host mode only)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENAUTOCLR_CLKGATE</name>
                     <description>Enables the feature to auto-clear the CLKGATE bit if there is wakeup event while USB is suspended</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENAUTOCLR_PHY_PWD</name>
                     <description>Enables the feature to auto-clear the PWD register bits in USBPHY_PWD if there is wakeup event while USB is suspended</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSDLL_RST_EN</name>
                     <description>Enables the feature to reset the FSDLL lock detection logic at the end of each TX packet</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTG_ID_VALUE</name>
                     <description>Indicates the results of USB_ID pin while monitoring the cable plugged into the Micro- or Mini-AB receptacle</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HOST_FORCE_LS_SE0</name>
                     <description>Forces the next FS packet that is transmitted to have a EOP with low-speed timing</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UTMI_SUSPENDM</name>
                     <description>Used by the PHY to indicate a powered-down state</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CLKGATE</name>
                     <description>Gate UTMI Clocks</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFTRST</name>
                     <description>Writing a 1 to this bit will soft-reset the USBPHY_PWD, USBPHY_TX, USBPHY_RX, and USBPHY_CTRL</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
