podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USBPHY1_MK28F15.svd.xml
            <register derivedFrom="CTRL"> <name>CTRL_SET</name> <addressOffset>0x34</addressOffset> </register>
            <register derivedFrom="CTRL"> <name>CTRL_CLR</name> <addressOffset>0x38</addressOffset> </register>
            <register derivedFrom="CTRL"> <name>CTRL_TOG</name> <addressOffset>0x3C</addressOffset> </register>
            <register>
               <name>STATUS</name>
               <description>USB PHY Status Register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>HOSTDISCONDETECT_STATUS</name>
                     <description>Indicates at the local host (downstream) port that the remote device has disconnected while in High-Speed mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>USB cable disconnect has not been detected at the local host</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>USB cable disconnect has been detected at the local host</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DEVPLUGIN_STATUS</name>
                     <description>Status indicator for non-standard resistive plugged-in detection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No attachment to a USB host is detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cable attachment to a USB host is detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OTGID_STATUS</name>
                     <description>Indicates the results of USB_ID pin on the USB cable plugged into the local Micro- or Mini-AB receptacle</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RESUME_STATUS</name>
                     <description>Indicates that the host is sending a wake-up after Suspend and has triggered an interrupt</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEBUG</name>
               <description>USB PHY Debug Register</description>
               <addressOffset>0x50</addressOffset>
               <resetValue>0x7F180000</resetValue>
               <fields>
                  <field>
                     <name>OTGIDPIOLOCK</name>
                     <description>Once OTG ID from USBPHY_STATUS_OTGID_STATUS is sampled, use this to hold the value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBUG_INTERFACE_HOLD</name>
                     <description>Use holding registers to assist in timing for external UTMI interface</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSTPULLDOWN</name>
                     <description>This bit field selects whether to connect pulldown resistors on the USB_DP/USB_DM pins if the corresponding pulldown overdrive mode is enabled through USBPHY_DEBUG[5:4} Set bit 3 to value 1&apos;b1 to connect the 15ohm pulldown on USB_DP line</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ENHSTPULLDOWN</name>
                     <description>This bit field selects host pulldown overdrive mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TX2RXCOUNT</name>
                     <description>Delay in between the end of transmit to the beginning of receive</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ENTX2RXCOUNT</name>
                     <description>Set this bit to allow a countdown to transition in between TX and RX</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SQUELCHRESETCOUNT</name>
                     <description>Delay in between the detection of squelch to the reset of high-speed RX</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ENSQUELCHRESET</name>
                     <description>Set bit to allow squelch to reset high-speed receive</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SQUELCHRESETLENGTH</name>
                     <description>Duration of RESET in terms of the number of 480-MHz cycles</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>HOST_RESUME_DEBUG</name>
                     <description>Choose to trigger the host resume SE0 with HOST_FORCE_LS_SE0 = 0 or UTMI_SUSPEND = 1</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKGATE</name>
                     <description>Gate Test Clocks</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="DEBUG"> <name>DEBUG_SET</name> <addressOffset>0x54</addressOffset> </register>
            <register derivedFrom="DEBUG"> <name>DEBUG_CLR</name> <addressOffset>0x58</addressOffset> </register>
            <register derivedFrom="DEBUG"> <name>DEBUG_TOG</name> <addressOffset>0x5C</addressOffset> </register>
            <register>
               <name>DEBUG0_STATUS</name>
               <description>UTMI Debug Status Register 0</description>
               <addressOffset>0x60</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LOOP_BACK_FAIL_COUNT</name>
                     <description>Running count of the failed pseudo-random generator loopback</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>UTMI_RXERROR_FAIL_COUNT</name>
                     <description>Running count of the UTMI_RXERROR</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>SQUELCH_COUNT</name>
                     <description>Running count of the squelch reset instead of normal end for HS RX</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEBUG1</name>
               <description>UTMI Debug Status Register 1</description>
               <addressOffset>0x70</addressOffset>
               <resetValue>0x1000</resetValue>
               <fields>
                  <field>
                     <name>ENTAILADJVD</name>
                     <description>Delay increment of the rise of squelch</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Delay is nominal</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Delay is +20%</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Delay is -20%</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Delay is -40%</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register derivedFrom="DEBUG1"> <name>DEBUG1_SET</name> <addressOffset>0x74</addressOffset> </register>
            <register derivedFrom="DEBUG1"> <name>DEBUG1_CLR</name> <addressOffset>0x78</addressOffset> </register>
            <register derivedFrom="DEBUG1"> <name>DEBUG1_TOG</name> <addressOffset>0x7C</addressOffset> </register>
            <register>
               <name>VERSION</name>
               <description>UTMI RTL Version</description>
               <addressOffset>0x80</addressOffset>
               <access>read-only</access>
               <resetValue>0x4030000</resetValue>
               <fields>
                  <field>
                     <name>STEP</name>
                     <description>Fixed read-only value reflecting the stepping of the RTL version</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MINOR</name>
                     <description>Fixed read-only value reflecting the MINOR field of the RTL version</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAJOR</name>
                     <description>Fixed read-only value reflecting the MAJOR field of the RTL version</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL_SIC</name>
               <description>USB PHY PLL Control/Status Register</description>
               <addressOffset>0xA0</addressOffset>
               <resetValue>0x12000</resetValue>
               <fields>
                  <field>
                     <name>PLL_DIV_SEL</name>
                     <description>This field controls the USB PLL feedback loop divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>PLL reference frequency = 24MHz</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>PLL reference frequency = 16MHz</description>
                           <value>0b01</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PLL_EN_USB_CLKS</name>
                     <description>Enable the USB clock output from the USB PHY PLL</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL_HOLD_RING_OFF</name>
                     <description>Analog debug bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL_POWER</name>
                     <description>Power up the USB PLL</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL_ENABLE</name>
                     <description>Enable the clock output from the USB PLL</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL_BYPASS</name>
                     <description>Bypass the USB PLL</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL_LOCK</name>
                     <description>USB PLL lock status indicator</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PLL is not currently locked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>PLL is currently locked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
